levizh/goodix_hdsc/hc32f46x_ddl_Rev1.1.1/example/i2s/i2s_fullduplex/source/main.c
/*******************************************************************************
 * Local function prototypes ('static')
 ******************************************************************************/
static void Record_Repeat(uint32_t buf, uint16_t size);
static void Record_Start(uint32_t buf, uint16_t size);
static void DMA_TC_PlayCallBack(void);
static void DMA_TC_RecordCallback(void);
static void Play_Repeat(uint32_t Addr, uint32_t Size);

/*******************************************************************************
 * Local variable definitions ('static')
 ******************************************************************************/
uint8_t u8Play_tx_flag = 0U;
uint16_t IsocInBuff[TOTAL_IN_BUF_SIZE];

uint16_t* IsocInWrPtr;
uint16_t IsocInWrCnt;

uint16_t IsocInRdCnt = 0U;
uint8_t work_state = IDLE_STATE;

/*******************************************************************************
 * Function implementation - global ('extern') and local ('static')
 ******************************************************************************/

/**
 ******************************************************************************
 ** \brief  DMA transfer complete irq call back function for play
 **
 ******************************************************************************/
static void DMA_TC_PlayCallBack(void)
{
    DMA_ClearIrqFlag(DMA_UNIT_PLAY, DMA_CH_PLAY, BlkTrnCpltIrq);
    DMA_ClearIrqFlag(DMA_UNIT_PLAY, DMA_CH_PLAY, TrnCpltIrq);
    u8Play_tx_flag = 1U;
}

/**
 ******************************************************************************
 ** \brief  DMA transfer complete irq call back function for record
 **
 ******************************************************************************/
static void DMA_TC_RecordCallback(void)
{
    DMA_ClearIrqFlag(DMA_UNIT_RECORD, DMA_CH_RECORD, TrnCpltIrq);

    Record_Repeat((uint32_t)(IsocInBuff+PACKET*IsocInRdCnt), PACKET);

    IsocInRdCnt++;
    if(IsocInRdCnt>=NUM)
    {
        IsocInRdCnt = 0U;
    }
}

/**
 ******************************************************************************
 ** \brief  reset the DTCTL and enable the DMA channel
 **
 ******************************************************************************/
static void Record_Repeat(uint32_t buf, uint16_t size)
{
    /* note: Don't use driver function for speed */
    DMA_UNIT_RECORD->DAR1 = buf;             //Rewrite the destination address
    DMA_UNIT_RECORD->DTCTL1_f.CNT = size;    //Rewrite the count
    DMA_UNIT_RECORD->DTCTL1_f.BLKSIZE = 1U;  //Rewrite the block size

    DMA_ChannelCmd(DMA_UNIT_RECORD, DMA_CH_RECORD, Enable);
}

/**
 ******************************************************************************
 ** \brief  Start record
 **
 ******************************************************************************/
static void Record_Start(uint32_t buf, uint16_t size)
{
    /* note: Don't use driver function for speed */
    DMA_UNIT_RECORD->DAR1 = buf;              //Rewrite the destination address
    DMA_UNIT_RECORD->DTCTL1_f.CNT = size;     //Rewrite the count
    DMA_UNIT_RECORD->DTCTL1_f.BLKSIZE = 1U;   //Rewrite the block size
    DMA_ChannelCmd(DMA_UNIT_RECORD, DMA_CH_RECORD, Enable);

    /* note: Don't use driver function for speed */
    I2S_CH->ER_f.RXERR = 1U;         //Clear the RX ERROR
    I2S_CH->CTRL_f.RXE = 1U;         //Enable the RX of I2S
}

/**
 ******************************************************************************
 ** \brief  Stop record
 **
 ******************************************************************************/
void Record_Stop(void)
{
    DMA_ChannelCmd(DMA_UNIT_RECORD, DMA_CH_RECORD, Disable);
    I2S_FuncCmd(I2S_CH, RxEn, Disable);
    I2S_ClrErrFlag(I2S_CH, ClrRxErrFlag);

    DMA_ChannelCmd(DMA_UNIT_PLAY, DMA_CH_PLAY, Disable);
    I2S_FuncCmd(I2S_CH, TxEn, Disable);
    I2S_ClrErrFlag(I2S_CH, ClrRxErrFlag);
}

/**
 ******************************************************************************
 ** \brief  Starts playing audio stream from the audio Media.
 ** \param  None
 ** \retval None
 **
 ******************************************************************************/
static void Play_Repeat(uint32_t Addr, uint32_t Size)
{
    /* note: Don't use driver function for speed */
    DMA_UNIT_PLAY->DTCTL0_f.BLKSIZE = 1U;
    DMA_UNIT_PLAY->DTCTL0_f.CNT     = Size;
    DMA_UNIT_PLAY->SAR0             = (uint32_t)Addr;

    DMA_ChannelCmd(DMA_UNIT_PLAY, DMA_CH_PLAY, Enable);

    /* note: Don't use driver function for speed */
    if(I2S_CH->ER_f.TXERR == 1U)               //Clear the tx error if it is true
    {
        I2S_CH->ER_f.TXERR = 1U;
    }
    I2S_CH->CTRL_f.TXE = 1U;                   //Enable the TX of I2S
}

/**
 ******************************************************************************
 ** \brief  Initialize the system clock for the sample
 **
 ** \param  None
 **
 ** \retval None
 ******************************************************************************/
static void SysClkIni(void)
{
    en_clk_sys_source_t     enSysClkSrc;
    stc_clk_sysclk_cfg_t    stcSysClkCfg;
    stc_clk_xtal_cfg_t      stcXtalCfg;
    stc_clk_mpll_cfg_t      stcMpllCfg;

    MEM_ZERO_STRUCT(enSysClkSrc);
    MEM_ZERO_STRUCT(stcSysClkCfg);
    MEM_ZERO_STRUCT(stcXtalCfg);
    MEM_ZERO_STRUCT(stcMpllCfg);

    /* Set bus clk div. */
    stcSysClkCfg.enHclkDiv = ClkSysclkDiv1;   // 168MHz
    stcSysClkCfg.enExclkDiv = ClkSysclkDiv2;  // 84MHz
    stcSysClkCfg.enPclk0Div = ClkSysclkDiv1;  // 168MHz
    stcSysClkCfg.enPclk1Div = ClkSysclkDiv2;  // 84MHz
    stcSysClkCfg.enPclk2Div = ClkSysclkDiv4;  // 42MHz
    stcSysClkCfg.enPclk3Div = ClkSysclkDiv4;  // 42MHz
    stcSysClkCfg.enPclk4Div = ClkSysclkDiv2;  // 84MHz
    CLK_SysClkConfig(&stcSysClkCfg);

    /* Switch system clock source to MPLL. */
    /* Use Xtal32 as MPLL source. */
    stcXtalCfg.enMode = ClkXtalModeOsc;
    stcXtalCfg.enDrv = ClkXtalLowDrv;
    stcXtalCfg.enFastStartup = Enable;
    CLK_XtalConfig(&stcXtalCfg);
    CLK_XtalCmd(Enable);

    /* MPLL config. */
    stcMpllCfg.pllmDiv = 1UL;
    stcMpllCfg.plln    = 42UL;
    stcMpllCfg.PllpDiv = 2UL;
    stcMpllCfg.PllqDiv = 2UL;
    stcMpllCfg.PllrDiv = 2UL;
    CLK_SetPllSource(ClkPllSrcXTAL);
    CLK_MpllConfig(&stcMpllCfg);

    /* flash read wait cycle setting */
    EFM_Unlock();
    EFM_SetLatency(EFM_LATENCY_4);
    EFM_Lock();

