levizh/goodix_hdsc/hc32f46x_ddl_Rev1.1.1/example/i2s/i2s_fullduplex/source/main.c
    if(Ok != WM8731_Init(I2C_CH, &stcWm8731Reg))
    {
        while(1);
    }
    WM8731_SetHpVolume(I2C_CH, 0x6f,0x6f);  //0x2F-MUTE ~ 0x7F Maximum
}

/**
 *******************************************************************************
 ** \brief  Initialize LED0 for indicate recoder status
 ** \param  None
 ** \retval None
 ******************************************************************************/
static void IniLedPort(void)
{
    stc_port_init_t stcPortInit;
    /*initiallize LED port*/
    MEM_ZERO_STRUCT(stcPortInit);

    stcPortInit.enPinMode = Pin_Mode_Out;
    stcPortInit.enExInt = Enable;
    stcPortInit.enPullUp = Enable;

    /* LED0 Port/Pin initialization */
    PORT_Init(LED0_PORT, LED0_PIN, &stcPortInit);
}

/**
 ******************************************************************************
 ** \brief  configure the channel0 of DMA2, use it to move data from buf to I2S3_TX buf
 **
 ******************************************************************************/
void DMA_ConfigPlay(void)
{
    stc_dma_config_t stcDmaCfg;
    MEM_ZERO_STRUCT(stcDmaCfg);

    /* Disable DMA1. */
    DMA_Cmd(DMA_UNIT_PLAY,Disable);
    DMA_ClearIrqFlag(DMA_UNIT_PLAY, DMA_CH_PLAY, BlkTrnCpltIrq);
    DMA_ClearIrqFlag(DMA_UNIT_PLAY, DMA_CH_PLAY, TrnCpltIrq);
    /* set the destination address */
    stcDmaCfg.u32DesAddr = (uint32_t)(&I2S_CH->TXBUF);

    /* Disable linked list transfer. */
    stcDmaCfg.stcDmaChCfg.enLlpEn = Disable;
    /* Enable repeat function. */
    stcDmaCfg.stcDmaChCfg.enSrcRptEn = Disable;
    stcDmaCfg.stcDmaChCfg.enDesRptEn = Disable;
    /* Set source & destination address mode. */
    stcDmaCfg.stcDmaChCfg.enSrcInc = AddressIncrease;
    stcDmaCfg.stcDmaChCfg.enDesInc = AddressFix;
    /* Enable interrup. */
    stcDmaCfg.stcDmaChCfg.enIntEn = Enable;
    /* Set data width 32bit. */
    stcDmaCfg.stcDmaChCfg.enTrnWidth = Dma16Bit;

    /* Enable DMA clock. */
    PWC_Fcg0PeriphClockCmd(DMA_PLAY_FCG, Enable);

    /* Enable DMA1. */
    DMA_Cmd(DMA_UNIT_PLAY, Enable);
    /* Initialize DMA. */
    DMA_InitChannel(DMA_UNIT_PLAY, DMA_CH_PLAY, &stcDmaCfg);
    /* Enable DMA1 channel0. */
    DMA_ChannelCmd(DMA_UNIT_PLAY, DMA_CH_PLAY, Enable);

    /* Enable PTDIS(AOS) clock*/
    PWC_Fcg0PeriphClockCmd(PWC_FCG0_PERIPH_AOS, Enable);
    DMA_SetTriggerSrc(DMA_UNIT_PLAY, DMA_CH_PLAY, EVT_I2S3_TXIRQOUT);
}

/**
 *******************************************************************************
 ** \brief  Initialize DMAC function for recorder
 ** \param  None
 ** \retval None
 ******************************************************************************/
void DMA_ConfigRecord(void)
{
    stc_dma_config_t stcDmaCfg;
    MEM_ZERO_STRUCT(stcDmaCfg);

    /* Set data block size. */
    stcDmaCfg.u16BlockSize = 1U;
    /* Set transfer count. */
    stcDmaCfg.u16TransferCnt = PACKET;
    /* Set source & destination address. */
    stcDmaCfg.u32SrcAddr = (uint32_t)(&I2S_CH->RXBUF);

    /* Disable linked list transfer. */
    stcDmaCfg.stcDmaChCfg.enLlpEn = Disable;
    /* Enable repeat function. */
    stcDmaCfg.stcDmaChCfg.enSrcRptEn = Disable;
    stcDmaCfg.stcDmaChCfg.enDesRptEn = Disable;
    /* Set source & destination address mode. */
    stcDmaCfg.stcDmaChCfg.enSrcInc = AddressFix;
    stcDmaCfg.stcDmaChCfg.enDesInc = AddressIncrease;
    /* Enable interrup. */
    stcDmaCfg.stcDmaChCfg.enIntEn = Enable;
    /* Set data width 32bit. */
    stcDmaCfg.stcDmaChCfg.enTrnWidth = Dma16Bit;

    /* Enable DMA clock. */
    PWC_Fcg0PeriphClockCmd(DMA_RECORD_FCG, Enable);

    /* Enable DMA1. */
    DMA_Cmd(DMA_UNIT_RECORD,Enable);
    /* Initialize DMA. */
    DMA_InitChannel(DMA_UNIT_RECORD, DMA_CH_RECORD, &stcDmaCfg);
    /* Enable DMA1 channel0. */
    DMA_ChannelCmd(DMA_UNIT_RECORD, DMA_CH_RECORD,Enable);

    /* Enable PTDIS(AOS) clock*/
    PWC_Fcg0PeriphClockCmd(PWC_FCG0_PERIPH_AOS,Enable);
    DMA_SetTriggerSrc(DMA_UNIT_RECORD, DMA_CH_RECORD, EVT_I2S3_RXIRQOUT);
}

/**
 ******************************************************************************
 ** \brief  configure the interrupt vector of channel2 of DMA2
 **
 ******************************************************************************/
void DMA_IrqConfigRecord(void)
{
    stc_irq_regi_conf_t stcIrqRegiConf;
    MEM_ZERO_STRUCT(stcIrqRegiConf);

    DMA_EnableIrq(DMA_UNIT_RECORD, DMA_CH_RECORD, TrnCpltIrq);
    /* Register TXIRQOUT Int to Vect.No.001 */
    stcIrqRegiConf.enIRQn = Int003_IRQn;
    /* Select interrupt function */
    stcIrqRegiConf.enIntSrc = DMA_RECORD_IRQ_SRC;
    /* Callback function */
    stcIrqRegiConf.pfnCallback = DMA_TC_RecordCallback;
    /* Registration IRQ */
    enIrqRegistration(&stcIrqRegiConf);
    /* Clear Pending */
    NVIC_ClearPendingIRQ(stcIrqRegiConf.enIRQn);
    /* Set priority */
    NVIC_SetPriority(stcIrqRegiConf.enIRQn, DDL_IRQ_PRIORITY_15);
    /* Enable NVIC */
    NVIC_EnableIRQ(stcIrqRegiConf.enIRQn);
}

/**
 ******************************************************************************
 ** \brief  configure the interrupt vector of channel0 of DMA2
 **
 ******************************************************************************/
void DMA_IrqConfigPlay(void)
{
    stc_irq_regi_conf_t stcIrqRegiConf;
    MEM_ZERO_STRUCT(stcIrqRegiConf);

    DMA_EnableIrq(DMA_UNIT_PLAY, DMA_CH_PLAY, TrnCpltIrq);
    /* Register TXIRQOUT Int to Vect.No.001 */
    stcIrqRegiConf.enIRQn = Int001_IRQn;
    /* Select interrupt function */
    stcIrqRegiConf.enIntSrc = DMA_PLAY_IRQ_SRC;
    /* Callback function */
    stcIrqRegiConf.pfnCallback = DMA_TC_PlayCallBack;
    /* Registration IRQ */
    enIrqRegistration(&stcIrqRegiConf);
    /* Clear Pending */
    NVIC_ClearPendingIRQ(stcIrqRegiConf.enIRQn);
    /* Set priority */
    NVIC_SetPriority(stcIrqRegiConf.enIRQn, DDL_IRQ_PRIORITY_14);
    /* Enable NVIC */
    NVIC_EnableIRQ(stcIrqRegiConf.enIRQn);
}

/**
 *******************************************************************************
 ** \brief  Get I2S clock frequency.
 **
 ** \param  [in] pstcI2sReg             Pointer to I2S register
 ** \arg    M4_I2S1                     I2s channel 1
 ** \arg    M4_I2S2                     I2s channel 2
 ** \arg    M4_I2S3                     I2s channel 3
 ** \arg    M4_I2S4                     I2s channel 4
 ** \retval uint32_t                    The  I2S clock frequency.
 ** \note   None
 ******************************************************************************/
uint32_t GetI2SClkFreq(M4_I2S_TypeDef* pstcI2sReg)
{
    en_clk_peri_source_t enSrc = ClkPeriSrcPclk;
    uint32_t u32Freq = 0ul;
    stc_clk_freq_t stcClkFreq;
    stc_pll_clk_freq_t stcPllClkFreq;

    /* Check parameters */
    if(NULL != pstcI2sReg)
    {
        enSrc = CLK_GetI2sClkSource(pstcI2sReg);
        CLK_GetClockFreq(&stcClkFreq);
        CLK_GetPllClockFreq(&stcPllClkFreq);
        switch(enSrc)
        {
            case ClkPeriSrcPclk:
                u32Freq = stcClkFreq.pclk1Freq;
                break;
            case ClkPeriSrcMpllp:
                u32Freq = stcPllClkFreq.mpllp;
                break;
            case ClkPeriSrcMpllq:
                u32Freq = stcPllClkFreq.mpllq;
                break;
            case ClkPeriSrcMpllr:
                u32Freq = stcPllClkFreq.mpllr;
                break;
            case ClkPeriSrcUpllp:
                u32Freq = stcPllClkFreq.upllp;
                break;
            case ClkPeriSrcUpllq:
                u32Freq = stcPllClkFreq.upllq;
                break;
            case ClkPeriSrcUpllr:
                u32Freq = stcPllClkFreq.upllr;
                break;
            default:
                break;
        }
    }
    return u32Freq;
}

/**
 ******************************************************************************
 ** \brief  configure the registers of I2S3
 **
 ******************************************************************************/
void I2s_Config(void)
{
    stc_i2s_config_t stcI2sCfg;
    MEM_ZERO_STRUCT(stcI2sCfg);

    /* Config i2s peripheral */
    I2s_DeInit(I2S_CH);
    stcI2sCfg.u32I2sInterClkFreq = GetI2SClkFreq(I2S_CH);
    stcI2sCfg.enStandrad = Std_Philips;
    stcI2sCfg.enMode = I2sMaster;
    stcI2sCfg.enFullDuplexMode = I2s_FullDuplex;
    stcI2sCfg.enChanelLen = I2s_ChLen_16Bit;
    stcI2sCfg.enDataBits = I2s_DataLen_16Bit;
    stcI2sCfg.u32AudioFreq = I2S_AudioFreq_48k;
#ifdef EXCK_ON
    stcI2sCfg.enMcoOutEn = Disable;
    stcI2sCfg.enExckEn = Enable;
#else
    stcI2sCfg.enMcoOutEn = Enable;
    stcI2sCfg.enExckEn = Disable;
#endif
    I2s_Init(I2S_CH, &stcI2sCfg);
}

/**
 *******************************************************************************
 ** \brief  Main function of project
 ** \param  None
 ** \retval int32_t return value, if needed
 ******************************************************************************/
int32_t main(void)
{
    /* Initialize system clock, PLL 168M */
    SysClkIni();
    /* Initialize LED0 */
    IniLedPort();

