levizh/goodix_hdsc/hc32f46x_ddl_Rev1.1.1/example/i2s/i2s_fullduplex/source/main.c
    WM8731_IO_Ini();
    WM8731_CodecConfig();

    DMA_ConfigPlay();
    DMA_ConfigRecord();
    DMA_IrqConfigPlay();
    DMA_IrqConfigRecord();

    I2s_Config();

    while(1)
    {
        switch (work_state)
        {
            case STOP_STATE:
                /* SW2 kick start record */
                if(PORT_GetBit(SW2_PORT, SW2_PIN) == 0U)
                {
                    Ddl_Delay1ms(400UL);
                    DMA_ConfigPlay();
                    I2s_Config();
                    Record_Start((uint32_t)IsocInBuff, PACKET);
                    work_state = RECORD_STATE;
                    LED0_TOGGLE();
                }
                break;
            case IDLE_STATE:
                /* SW2 kick start record */
                if(PORT_GetBit(SW2_PORT, SW2_PIN) == 0U)
                {
                    Ddl_Delay1ms(400UL);

                    Record_Start((uint32_t)IsocInBuff, PACKET);
                    work_state = RECORD_STATE;
                    LED0_TOGGLE();
                }
                break;
            case RECORD_STATE:
                if(IsocInRdCnt >= (NUM>>1U))
                {
                    /* Kick start play */
                    work_state = ALL_RUN_STATE;
                    IsocInWrPtr = IsocInBuff;
                    Play_Repeat((uint32_t)IsocInWrPtr, PACKET);
                    IsocInWrCnt++;
                }
                break;

            case ALL_RUN_STATE:
                if(u8Play_tx_flag == 1U)
                {
                    /* Play next packet audio data */
                    u8Play_tx_flag = 0U;
                    Play_Repeat((uint32_t)(IsocInWrPtr+PACKET*IsocInWrCnt), PACKET);
                    IsocInWrCnt++;

                    if(IsocInWrCnt>=NUM)
                    {
                        IsocInWrCnt = 0U;
                        IsocInWrPtr = IsocInBuff;
                    }
                }
                /* SW3 stop record and play */
                if(PORT_GetBit(SW3_PORT, SW3_PIN) == 0U)
                {
                    Ddl_Delay1ms(400UL);
                    Record_Stop();

                    work_state = STOP_STATE;
                    IsocInRdCnt = 0U;
                    LED0_TOGGLE();
                }
            default:
                break;
        }
    }
}

/*******************************************************************************
 * EOF (not truncated)
 ******************************************************************************/
